In [1]:
import kaggle
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [37]:
train=pd.read_csv('train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
test=pd.read_csv('test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [39]:
submission=pd.read_csv('gender_submission.csv')
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [40]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [6]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [41]:
nouse=['Name','Cabin','Ticket']
train=train.drop(columns=nouse)
test=test.drop(columns=nouse)

In [42]:
train.count()

PassengerId    891
Survived       891
Pclass         891
Sex            891
Age            714
SibSp          891
Parch          891
Fare           891
Embarked       889
dtype: int64

In [43]:
train['Age']=train['Age'].fillna(train['Age'].median())
train['Embarked']=train['Embarked'].fillna(method='ffill')

In [12]:
train.count()

PassengerId    891
Survived       891
Pclass         891
Sex            891
Age            891
SibSp          891
Parch          891
Fare           891
Embarked       891
dtype: int64

In [14]:
test.count()

PassengerId    418
Pclass         418
Sex            418
Age            332
SibSp          418
Parch          418
Fare           417
Embarked       418
dtype: int64

In [44]:
test['Age']=test['Age'].fillna(test['Age'].median())
test['Embarked']=test['Embarked'].fillna(method='pad')
test['Fare']=test['Fare'].fillna(test['Fare'].mean())

In [16]:
test.count()

PassengerId    418
Pclass         418
Sex            418
Age            418
SibSp          418
Parch          418
Fare           418
Embarked       418
dtype: int64

In [45]:
Y=train['Survived']

In [46]:
train=train.drop(columns='Survived')

In [47]:
combine=pd.concat([train,test])
combine.tail()

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
413         1305       3    male  27.0      0      0    8.0500        S
414         1306       1  female  39.0      0      0  108.9000        C
415         1307       3    male  38.5      0      0    7.2500        S
416         1308       3    male  27.0      0      0    8.0500        S
417         1309       3    male  27.0      1      1   22.3583        C

In [48]:
combine['Sex_d']=combine['Sex'].map({'male':0,'female':1}).astype(int)
combine.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Sex_d
0            1       3    male  22.0      1      0   7.2500        S      0
1            2       1  female  38.0      1      0  71.2833        C      1
2            3       3  female  26.0      0      0   7.9250        S      1
3            4       1  female  35.0      1      0  53.1000        S      1
4            5       3    male  35.0      0      0   8.0500        S      0

In [56]:
embark_list=combine['Embarked'].unique().tolist()
embark_list

['S', 'C', 'Q']

In [65]:
dictOfWords = { embark_list[i]:i  for i in range(0, len(embark_list) ) }
dictOfWords

{'S': 0, 'C': 1, 'Q': 2}

In [66]:
combine['embark']=combine['Embarked'].map(dictOfWords).astype(int)

In [67]:
combine.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Sex_d,embark
0,1,3,male,22.0,1,0,7.2500,S,0,0
1,2,1,female,38.0,1,0,71.2833,C,1,1
2,3,3,female,26.0,0,0,7.9250,S,1,0
3,4,1,female,35.0,1,0,53.1000,S,1,0
4,5,3,male,35.0,0,0,8.0500,S,0,0

In [68]:
nonenum=['Sex','Embarked']
combine=combine.drop(columns=nonenum)

In [69]:
combine.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  Sex_d  embark
0            1       3  22.0      1      0   7.2500      0       0
1            2       1  38.0      1      0  71.2833      1       1
2            3       3  26.0      0      0   7.9250      1       0
3            4       1  35.0      1      0  53.1000      1       0
4            5       3  35.0      0      0   8.0500      0       0

In [75]:
train=combine.iloc[:891]
train.tail()

     PassengerId  Pclass   Age  SibSp  Parch   Fare  Sex_d  embark
886          887       2  27.0      0      0  13.00      0       0
887          888       1  19.0      0      0  30.00      1       0
888          889       3  28.0      1      2  23.45      1       0
889          890       1  26.0      0      0  30.00      0       1
890          891       3  32.0      0      0   7.75      0       2

In [80]:
test=combine.iloc[891:]
test.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  Sex_d  embark
0          892       3  34.5      0      0   7.8292      0       2
1          893       3  47.0      1      0   7.0000      1       0
2          894       2  62.0      0      0   9.6875      0       2
3          895       3  27.0      0      0   8.6625      0       0
4          896       3  22.0      1      1  12.2875      1       0

In [78]:
len(Y)

891

## Machine Learning Model

### Decision Tree

In [99]:
import sklearn
from sklearn.tree import DecisionTreeClassifier

In [100]:
#dicision tree
DT=sklearn.tree.DecisionTreeClassifier(random_state=0)
gini=DecisionTreeClassifier(criterion='gini',min_samples_leaf=5)
gini.fit(train,Y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=5, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [101]:
Y_pre_g=gini.predict(test)

In [128]:
submission['Survived']=Y_pre_g

In [129]:
submission.to_csv('submission2.csv',index=False)

In [131]:
! kaggle competitions submit -c titanic -f submission2.csv -m "simple test of gini decision tree with min_samples_leaf"

Successfully submitted to Titanic: Machine Learning from Disaster

  0%|          | 0.00/3.18k [00:00<?, ?B/s]
100%|██████████| 3.18k/3.18k [00:00<00:00, 17.1kB/s]

##### The result turns out to be 0.736

### K nearest neighbours

In [133]:
#K nearest neighbours
from sklearn.neighbors import KNeighborsClassifier

In [135]:
neigh=KNeighborsClassifier(n_neighbors=25,weights='uniform',algorithm='auto')
neigh.fit(train,Y)
Y_pre_KN=neigh.predict(test)

In [136]:
submission['Survived']=Y_pre_KN
submission.to_csv('submission3.csv',index=False)

In [138]:
! kaggle competitions submit -c titanic -f submission3.csv -m "simple test of K nearest neighbor"

Successfully submitted to Titanic: Machine Learning from Disaster

  0%|          | 0.00/3.18k [00:00<?, ?B/s]
100%|██████████| 3.18k/3.18k [00:00<00:00, 16.1kB/s]

##### the result is 0.6411. Not ideal .....

### Random Forest

In [82]:
import warnings
warnings.filterwarnings("ignore")

In [83]:
#random forest
from sklearn.ensemble import RandomForestClassifier
RF=RandomForestClassifier()
RF.fit(train,Y)
Y_pre=RF.predict(test)

In [84]:
submission['Survived']=Y_pre
submission.to_csv('submission4.csv',index=False)

In [86]:
! kaggle competitions submit -c titanic -f submission4.csv -m"random forest test "

Successfully submitted to Titanic: Machine Learning from Disaster

  0%|          | 0.00/3.18k [00:00<?, ?B/s]
100%|██████████| 3.18k/3.18k [00:00<00:00, 26.7kB/s]

##### the result is 0.7799.

### Logistic Regression

In [90]:
# Logistic Regression
from sklearn.linear_model import LogisticRegression
logreg = LogisticRegression()
logreg.fit(train, Y)
Y_pred = logreg.predict(test)
acc_log = round(logreg.score(train, Y) * 100, 2)
acc_log

80.13

In [91]:
submission['Survived']=Y_pred
submission.to_csv('submission6.csv',index=False)

In [92]:
! kaggle competitions submit -c titanic -f submission6.csv -m"logistic regression"

Successfully submitted to Titanic: Machine Learning from Disaster

  0%|          | 0.00/3.18k [00:00<?, ?B/s]
100%|██████████| 3.18k/3.18k [00:00<00:00, 28.1kB/s]

##### the result is 0.75

### SVM

In [94]:
# Support Vector Machines
from sklearn.svm import SVC
svc = SVC()
svc.fit(train, Y)
Y_pred = svc.predict(test)
acc_svc = round(svc.score(train, Y) * 100, 2)
acc_svc

99.55

In [95]:
submission['Survived']=Y_pred
submission.to_csv('submission_svc.csv',index=False)

In [96]:
! kaggle competitions submit -c titanic -f submission_svc.csv -m"svc test"

Successfully submitted to Titanic: Machine Learning from Disaster

  0%|          | 0.00/3.18k [00:00<?, ?B/s]
100%|██████████| 3.18k/3.18k [00:00<00:00, 29.4kB/s]

##### A little bit surprising that SVC performs really good on the train set, but the result of test set is only 0.62

### Things can be improved:

###### 1.more data exploration can be done, including the data visulization to find more relations between features to better serve the fillna process and create may do feature engineering to add more features
###### 2.more infomation can be extracted from the name or the fare variables
###### 3.cross validation may applied
###### 4.hyper parameter tuning process may applied